ERP.belugaerp/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_ВариантСинхронизацииWMS</name>
    <type>
      <types>EnumRef.бг_ВариантыСинхронизацииНоменклатурыWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВедетсяВERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидКлассификатораНСИ</name>
    <type>
      <types>EnumRef.бг_ВидКлассификатораНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕдиницаИзмеренияМест</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьЗаявлениеОВыдачеФСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьКонечныйНомерДиапазона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНакладнаяНаВыдачуФСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНачальныйНомерДиапазона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНомерДиапазонаВРулоне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНомерРулона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьСериюМарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НеФормироватьНаименованиеПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОграничиватьДобавлениеИзменениеНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УстановитьДействиеОтгрузитьВЗаказеПриЗагрузкеРТиУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьДатуПроизводстваСерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокГодностиСерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобенностьУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ПолитикиУчетаСерий</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПолитикаУчетаСерий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/ВидыНоменклатуры/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	бг_ДобавитьПоляФСМ();
	бг_ДобавитьПолеЦентрализованнаяНоменклатура();
	бг_ДобавитьПолеОграниченияДобавленияИзмененияНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	бг_ДобавитьПоляФСМ();
	бг_ДобавитьПолеЦентрализованнаяНоменклатура();
	бг_ДобавитьПолеОграниченияДобавленияИзмененияНоменклатуры();
	бг_ДобавитьПолеВидОперацииНалогообложения();
	бг_ДобавитьПолеУчетОстатковИРезервовВРазрезеУпаковокПаллет();
	бг_ДобавитьПолеНеФормироватьНаименованиеПоШаблону();
	бг_ДобавитьПолеВидКлассификатораНоменклатуры();
	бг_ДобавитьПолеВариантСинхронизацииWMS();
	бг_ДобавитьПолеЕдиницаИзмеренияМест();
	бг_ДобавитьПолеУстановитьДействиеОтгрузитьВЗаказеПриЗагрузкеРТиУ();
	
	бг_УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры
&НаКлиенте
Процедура бг_ПриОткрытииПосле(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ПослеЗаписиПосле(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьПоляФСМ()
	
	Если Элементы.Найти("ГруппаФСМ") <> Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ГруппаФСМ = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
		ЭтотОбъект, 
		"ГруппаФСМ", 
		Элементы.ИспользуемыеРеквизитыСерий);
	ГруппаФСМ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаФСМ.ОтображатьЗаголовок = Ложь;
	ГруппаФСМ.Заголовок = НСтр("ru = 'ФСМ'; en = 'ФСМ'");

	бг_ИспользоватьСериюМарки = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект, 
		"бг_ИспользоватьСериюМарки", 
		ГруппаФСМ, 
		"Объект.бг_ИспользоватьСериюМарки");
	бг_ИспользоватьСериюМарки.Заголовок = НСтр("ru = 'Серия марки'; en = 'Серия марки'");
	бг_ИспользоватьСериюМарки.Вид = ВидПоляФормы.ПолеФлажка;
	
	бг_ИспользоватьНомерРулона = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект, 
		"бг_ИспользоватьНомерРулона", 
		ГруппаФСМ, 
		"Объект.бг_ИспользоватьНомерРулона");
	бг_ИспользоватьНомерРулона.Заголовок = НСтр("ru = 'Номер рулона'; en = 'Номер рулона'");
	бг_ИспользоватьНомерРулона.Вид = ВидПоляФормы.ПолеФлажка;	
	
	бг_ИспользоватьНомерДиапазонаВРулоне = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект, 
		"бг_ИспользоватьНомерДиапазонаВРулоне", 
		ГруппаФСМ, 
		"Объект.бг_ИспользоватьНомерДиапазонаВРулоне");
	бг_ИспользоватьНомерДиапазонаВРулоне.Заголовок = НСтр("ru = 'Номер диапазона в рулоне'; en = 'Номер диапазона в рулоне'");
	бг_ИспользоватьНомерДиапазонаВРулоне.Вид = ВидПоляФормы.ПолеФлажка;	
	
	бг_ИспользоватьНачальныйНомерДиапазона = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект, 
		"бг_ИспользоватьНачальныйНомерДиапазона", 
		ГруппаФСМ, 
		"Объект.бг_ИспользоватьНачальныйНомерДиапазона");
	бг_ИспользоватьНачальныйНомерДиапазона.Заголовок = НСтр("ru = 'Начальный номер диапазона'; en = 'Начальный номер диапазона'");
	бг_ИспользоватьНачальныйНомерДиапазона.Вид = ВидПоляФормы.ПолеФлажка;	
		
	бг_ИспользоватьКонечныйНомерДиапазона = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект, 
		"бг_ИспользоватьКонечныйНомерДиапазона", 
		ГруппаФСМ, 
		"Объект.бг_ИспользоватьКонечныйНомерДиапазона");
	бг_ИспользоватьКонечныйНомерДиапазона.Заголовок = НСтр("ru = 'Конечный номер диапазона'; en = 'Конечный номер диапазона'");
	бг_ИспользоватьКонечныйНомерДиапазона.Вид = ВидПоляФормы.ПолеФлажка;	
	
	бг_ИспользоватьЗаявлениеОВыдачеФСМ = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект, 
		"бг_ИспользоватьЗаявлениеОВыдачеФСМ", 
		ГруппаФСМ, 
		"Объект.бг_ИспользоватьЗаявлениеОВыдачеФСМ");
	бг_ИспользоватьЗаявлениеОВыдачеФСМ.Заголовок = НСтр("ru = 'Заявление ФСМ'; en = 'Заявление ФСМ'");
	бг_ИспользоватьЗаявлениеОВыдачеФСМ.Вид = ВидПоляФормы.ПолеФлажка;	
	
	бг_ИспользоватьНакладнаяНаВыдачуФСМ = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект, 
		"бг_ИспользоватьНакладнаяНаВыдачуФСМ", 
		ГруппаФСМ, 
		"Объект.бг_ИспользоватьНакладнаяНаВыдачуФСМ");
	бг_ИспользоватьНакладнаяНаВыдачуФСМ.Заголовок = НСтр("ru = 'Выдача ФСМ'; en = 'Выдача ФСМ'");
	бг_ИспользоватьНакладнаяНаВыдачуФСМ.Вид = ВидПоляФормы.ПолеФлажка;	
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеЦентрализованнаяНоменклатура()
	
	Если Элементы.Найти("бг_ВедетсяВERP") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	бг_ВедетсяВERP = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект, 
		"бг_ВедетсяВERP", 
		Элементы.СтраницаОсновное, 
		"Объект.бг_ВедетсяВERP",
		,
		Элементы.Описание);
	бг_ВедетсяВERP.Заголовок = НСтр("ru = 'Номенклатура ведется централизованно в ERP'");
	бг_ВедетсяВERP.Вид = ВидПоляФормы.ПолеФлажка;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеОграниченияДобавленияИзмененияНоменклатуры()
	
	Если Элементы.Найти("бг_ОграничиватьДобавлениеИзменениеНоменклатуры") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	бг_ОграничиватьДобавлениеИзменениеНоменклатуры = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ОграничиватьДобавлениеИзменениеНоменклатуры",
		Элементы.СтраницаОсновное,
		"Объект.бг_ОграничиватьДобавлениеИзменениеНоменклатуры",
		, // ТипЭлемента
		, // Элемент
		"ПолеФлажка");
	
	бг_ОграничиватьДобавлениеИзменениеНоменклатуры.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеУчетОстатковИРезервовВРазрезеУпаковокПаллет()
	
	Если Элементы.Найти("бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет = 
		бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
				ЭтотОбъект,
				"бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет",
				Элементы.СтраницаОсновное,
				"Объект.бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет", , 
				Элементы.бг_ВидОперацииНалогообложенияАкцизом,
				"ПолеФлажка");
	
	бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеНеФормироватьНаименованиеПоШаблону()
	
	Если Элементы.Найти("бг_НеФормироватьНаименованиеПоШаблону") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	бг_НеФормироватьНаименованиеПоШаблону = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_НеФормироватьНаименованиеПоШаблону",
		Элементы.СтраницаОсновное,
		"Объект.бг_НеФормироватьНаименованиеПоШаблону",
		, // ТипЭлемента
		Элементы.бг_ВидОперацииНалогообложенияАкцизом,
		"ПолеФлажка");
	
	бг_НеФормироватьНаименованиеПоШаблону.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеВидОперацииНалогообложения()
	
	бг_ВидОперацииНалогообложенияАкцизом = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ВидОперацииНалогообложенияАкцизом",
		Элементы.СтраницаОсновное,
		"Объект.бг_ВидОперацииНалогообложенияАкцизом");
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеВариантСинхронизацииWMS()

	бг_ВариантСинхронизацииWMS = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ВариантСинхронизацииWMS",
		Элементы.СтраницаОсновное,
		"Объект.бг_ВариантСинхронизацииWMS");
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеЕдиницаИзмеренияМест()

	бг_ЕдиницаИзмеренияМест = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ЕдиницаИзмеренияМест",
		Элементы.ГруппаЕдиницыИзмеренияИУсловияХранения,
		"Объект.бг_ЕдиницаИзмеренияМест",, 
		Элементы.СкладскаяГруппа);
		
	бг_ЕдиницаИзмеренияМест.Ширина = 9;
	бг_ЕдиницаИзмеренияМест.РастягиватьПоГоризонтали = Ложь;
	бг_ЕдиницаИзмеренияМест.КнопкаВыпадающегоСписка = Ложь;
	бг_ЕдиницаИзмеренияМест.КнопкаВыбора = Истина;
	бг_ЕдиницаИзмеренияМест.КнопкаОткрытия = Ложь;
	бг_ЕдиницаИзмеренияМест.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;

КонецПроцедуры	

&НаСервере
Процедура бг_ДобавитьПолеУстановитьДействиеОтгрузитьВЗаказеПриЗагрузкеРТиУ()
	
	Если Элементы.Найти("бг_УстановитьДействиеОтгрузитьВЗаказеПриЗагрузкеРТиУ") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	бг_УстановитьДействиеОтгрузитьВЗаказеПриЗагрузкеРТиУ =
		бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
			ЭтотОбъект,
			"бг_УстановитьДействиеОтгрузитьВЗаказеПриЗагрузкеРТиУ",
			Элементы.СтраницаОсновное,
			"Объект.бг_УстановитьДействиеОтгрузитьВЗаказеПриЗагрузкеРТиУ", , ,
			"ПолеФлажка");
	
	бг_УстановитьДействиеОтгрузитьВЗаказеПриЗагрузкеРТиУ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьПолеВидКлассификатораНоменклатуры()
	
	бг_ВидКлассификатораНСИ = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ВидКлассификатораНСИ",
		Элементы.СтраницаОсновное,
		"Объект.бг_ВидКлассификатораНСИ");
	
	бг_ВидКлассификатораНСИ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	
КонецПроцедуры

&После("ТипНоменклатурыПриИзмененииСервер")
&НаСервере
Процедура бг_ТипНоменклатурыПриИзмененииСервер()
	бг_УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура бг_УстановитьВидимостьДоступностьЭлементов()
	Элементы.бг_ВидОперацииНалогообложенияАкцизом.Видимость = Объект.АлкогольнаяПродукция;
КонецПРоцедуры

#КонецОбласти
